InformationRegisters/СведенияОбОкладахСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СведенияОбОкладахСотрудников</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СведенияОбОкладахСотрудников/Ext/ManagerModule.bsl
Функция ПолучитьОклад(СотрудникОтбора, ПериодОтбора) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведениеОбОкладахСотрудниковСрезПоследних.Оклад КАК Оклад
		|ИЗ
		|	РегистрСведений.СведенияОбОкладахСотрудников.СрезПоследних(&ПериодСреза, Сотрудник = &СотрудникОтбора) КАК СведениеОбОкладахСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("ПериодСреза", ПериодОтбора);
	Запрос.УстановитьПараметр("СотрудникОтбора", СотрудникОтбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОкладСотрудника = 0;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		ОкладСотрудника = ВыборкаДетальныеЗаписи.Оклад;
		
	КонецЕсли;   
	
	Возврат ОкладСотрудника;	
	
КонецФункции // ()
